Revit 2026 API

# FamilySizeTable Class

---

Contains size information for a family.

SystemObject Autodesk.Revit.DBFamilySizeTable

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilySizeTable : IDisposable
```
```vb
Public Class FamilySizeTable
	Implements IDisposable
```
```cpp
public ref class FamilySizeTable : IDisposable
```
```fsharp
type FamilySizeTable =
    class
        interface IDisposable
    end
```

The FamilySizeTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfColumns | Number of columns in the table. |
|  | NumberOfRows | Number of rows in the table. |

|  | Name | Description |
| --- | --- | --- |
|  | AsValueString | Gets the table cell value as a string. |
|  | Dispose | Releases all resources used by the FamilySizeTable |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetColumnHeader | Gets a column of the table at at given index. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidColumnIndex | Checks if the column index is valid. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace